var participants = [
["宮尾 祐介", "NII 宮尾研", "S"],
["持橋 大地", "統数研", "S"],
["建石 由佳", "NII 宮尾研", "S"],
["横野 光", "NII 稲邑研", "S"],
["亀田 尭宙", "NII 武田研", "S"],
["田 然", "NII 宮尾研", "S"],
["能地 宏", "NII 宮尾研", "D"],
["原 忠義", "NII 相澤研", "S"],
["大橋 駿介", "東京大学 相澤研", "M"],
["李 心剣", "東京大 相澤研", "M"],
["周 双双", "東北大 乾・岡崎研", "D"],
["水野 淳太", "NICT・ユニバーサルコミュニケーション研究所", "S"],
["井之上 直也", "東北大 乾・岡崎研", "S"],
["髙瀬 翔", "東北大 乾・岡崎研", "M"],
["松林 優一郎", "東北大 乾・岡崎研", "S"],
["岡崎 直観", "東北大 乾・岡崎研", "S"],
["杉浦 純", "東北大 乾・岡崎研", "D"],
["乾 健太郎", "東北大 乾・岡崎研", "S"],
["渡邉 研人", "東北大 乾・岡崎研", "M"],
["成田 和弥", "東北大 乾・岡崎研", "D"],
["小町 守", "首都大学東京", "S"],
["江原　遥", "東大 中川研", "D"],
["松田 耕史", "東工大 奥村・高村研", "S"],
["森田 一", "東工大 奥村・高村研", "D"],
["菊池 悠太", "東工大 奥村・高村研", "D"],
["瀧本 洋喜", "東工大 奥村・高村研", "M"],
["橋本 和真", "東京大 近山・鶴岡研", "M"],
["佐藤 美沙", "東京大 近山・鶴岡研", "M"],
["成川 弘樹", "東京大 近山・鶴岡研", "M"],
["梁 成基", "東京大 近山・鶴岡研", "D"],
["三輪 誠", "マンチェスター大 NaCTeM", "S"],
["松原勇介", "東大・ソーシャルICT研究センター", "S"],
["鍜治 伸裕", "東京大 喜連川・豊田研", "S"],
["賀沢 秀人", "グーグル株式会社", "S"]
];

var reserves = [
["李", "NII 相澤研", "M"],
["大橋", "NII 相澤研", "M"],
["Pontus", "NII 相澤研", "S"],
["成田 和弥", "東北大 乾・岡崎研", "D"],
["松原 勇介", "産業技術総合研究所", "S"],
["藤沼 祥成","東京大学（NII） 相澤研","M"]
];

var committee = [
["原 忠義", "NII 相澤研", "S"],
["亀田 尭宙", "NII 武田研", "S"],
["能地 宏", "NII 宮尾研", "D"],
["松林 優一郎", "東北大 乾・岡崎研", "S"],
["髙瀬 翔", "東北大 乾・岡崎研", "M"],
["渡邉 研人", "東北大 乾・岡崎研", "M"],
["三輪 誠", "マンチェスター大 NaCTeM", "S"],
["橋本 和真", "東京大 近山・鶴岡研", "M"],
["佐藤 美沙", "東京大 近山・鶴岡研", "M"],
["成川 弘樹", "東京大 近山・鶴岡研", "M"]
];

$(function () {
	$('.talk').each(function(i){
		var data = $(this).text().split(/,/);
		$(this).text("");
		$(this).append('<a href="http://www.google.com/search?q='+$.trim(data[0])+' inurl:aclweb.org'+'&btnI=whatever">'+$.trim(data[0])+'</a>');
		$(this).append('<div class="right">('+$.trim(data[1])+', <a href="'+$.trim(data[2])+'">slide</a>)')
	});
	$('#num_participants').text(participants.length);
	$('#participants').append(nameList(participants, ', '));
	$('#committee').append(nameList(committee, '<br />'));

});

function nameList(names, splitter){
	var list = [];
	for (var i = 0; i < names.length; i++) {
		list.push(names[i][0] + '('+names[i][1]+')');
	}
	return list.join(splitter);
}